Tekla Open API Reference for Tekla Structures 2025
AnalysisModelLoad Methods
The AnalysisModelLoad type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis node. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisModelLoad Class
Tekla.Structures.Analysis Namespace